Repository: Link-God/django-password-validators
Catalog: django_password_validators/locale/*/LC_MESSAGES/django.po
Languages: ru

source: This password must contain at least %(min_length)d letter.
ru: Этот пароль должен содержать по крайней мере %(min_length)d букву.

source: This password must contain at least %(min_length)d upper case letter.
ru: Этот пароль должен содержать не менее %(min_length)d заглавной буквы.

source: This password must contain at least %(min_length)d lower case letter.
ru: Этот пароль должен содержать не менее %(min_length)d строчной буквы.

source: This password must contain at least %(min_length)d special character.
ru: Этот пароль должен содержать по крайней мере %(min_length)d специальный символ.

source: %(min_length)s letter
ru: %(min_length)s буква

source: %(min_length)s digit
ru: %(min_length)s цифра

source: %(min_length)s lower case letter
ru: %(min_length)s строчная буква

source: %(min_length)s upper case letter
ru: %(min_length)s заглавная буква

source: %(min_length_special)s special character, such as %(special_characters)s
ru: %(min_length_special)s специальный символ, такой как %(special_characters)s

source: This password must contain at least
ru: Этот пароль должен содержать по крайней мере

source: When created salt
ru: При создании соли

source: Salt for the user
ru: Соль для пользователя

source: The number of iterations for hasher
ru: Количество итераций для хэширования

source: Configuration
ru: Конфигурация

source: Configurations
ru: Конфигурации

source: Password hash
ru: Хэш пароля

source: Date
ru: Дата

source: You can not use a password that is already used in this application.
ru: Вы не можете использовать пароль, который уже используется в этом приложении.

source: Your new password can not be identical to any of the %(old_pass)d previously entered passwords.
ru: Ваш новый пароль не может быть идентичен ни одному из %(old_pass)d ранее введенных паролей.

source: Your new password can not be identical to any of the previously entered.
ru: Ваш новый пароль не может быть идентичен ни одному из ранее введенных.
